# Домашнее задание № 5

## Собрать базовую схему компьютер - свитч - роутер - свитч - компьютер.

Для настройки роутера Cisco 2901 в Cisco Packet Tracer 8.2.2 для соединения двух компьютеров и двух коммутаторов, выполните следующие шаги:

### 1. Создание топологии

1. **Откройте Cisco Packet Tracer**.
2. **Добавьте устройства**:
   - Роутер Cisco 2901.
   - Два коммутатора (например, Cisco 2960).
   - Два компьютера (PC).

3. **Соедините устройства**:
   - Соедините каждый компьютер с одним из коммутаторов с помощью медных кабелей (Copper Straight-Through).
   - Соедините каждый коммутатор с роутером с помощью медных кабелей (Copper Straight-Through).

### 2. Настройка коммутаторов

Коммутаторы обычно не требуют сложной настройки, так как они работают на уровне 2 и автоматически обучаются MAC-адресам. Однако, если необходимо, можно настроить VLAN и другие параметры.

### 3. Настройка роутера

1. **Подключитесь к роутеру**:
   - Откройте консоль роутера.
   - Перейдите в режим привилегированного пользователя:
     ```shell
     Router> enable
     ```

2. **Настройте интерфейсы**:
   - Перейдите в режим глобальной конфигурации:
     ```shell
     Router# configure terminal
     ```
   - Настройте интерфейсы, подключенные к коммутаторам. Например, если интерфейсы GigabitEthernet0/0 и GigabitEthernet0/1 подключены к коммутаторам:
     ```shell
     Router(config)# interface GigabitEthernet0/0
     Router(config-if)# ip address 192.168.1.1 255.255.255.0
     Router(config-if)# no shutdown
     Router(config-if)# exit

     Router(config)# interface GigabitEthernet0/1
     Router(config-if)# ip address 192.168.2.1 255.255.255.0
     Router(config-if)# no shutdown
     Router(config-if)# exit
     ```

3. **Настройте маршрутизацию**:
   - Если необходимо, настройте статические маршруты или включите динамическую маршрутизацию (например, RIP, OSPF). Для простоты, настроим статические маршруты:
     ```shell
     Router(config)# ip route 192.168.2.0 255.255.255.0 192.168.1.1
     Router(config)# ip route 192.168.1.0 255.255.255.0 192.168.2.1
     ```

### 4. Настройка компьютеров

1. **Настройте IP-адреса**:
   - Откройте консоль каждого компьютера.
   - Настройте IP-адреса и шлюзы по умолчанию:
     - Для компьютера, подключенного к первому коммутатору:
       ```shell
       IP Address: 192.168.1.2
       Subnet Mask: 255.255.255.0
       Default Gateway: 192.168.1.1
       ```
     - Для компьютера, подключенного ко второму коммутатору:
       ```shell
       IP Address: 192.168.2.2
       Subnet Mask: 255.255.255.0
       Default Gateway: 192.168.2.1
       ```

### 5. Проверка соединения

1. **Проверьте соединение**:
   - С каждого компьютера попробуйте выполнить команду `ping` до другого компьютера:
     ```shell
     ping 192.168.2.2
     ```
     и
     ```shell
     ping 192.168.1.2
     ```

Если все настроено правильно, компьютеры должны успешно обмениваться данными через роутер.

![Image](/Task5/img/CPT1.png)

